Revit 2026 API
LeaderEndCondition Enumeration
 An enumerated type listing Leader end conditions that are supported for IndependentTags.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public enum LeaderEndCondition
Public Enumeration LeaderEndCondition
public enum class LeaderEndCondition
type LeaderEndCondition
Members
Member name | Value | Description
Attached | 0 |  The Leader of the tag is attached.
Free | 1 |  The Leader of the tag is free.
See Also
Reference
Autodesk.Revit.DB Namespace